# P1: Data cleaning

__Tasks:__

- Handle missing / duplicate values
- Generate 2 new columns: `Working Type`, `Job level` from the `Description`
- Split `Location` into 3 new columns city, state, postcode
- Seperate the `Salary` into 2 new columns: Min and Max salary
- Correct data types of each features

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('../indeed_kaggle.csv')

In [4]:
df.head(10)

,Title,Company,Location,Salary,Description,Job URL,Date,State
0,Data Scientist,"DESE Research, Inc.","Huntsville, AL 35806",NaN,"Familiarity with advanced machine learning, da...",https://www.indeed.com/rc/clk?jk=b31b63cb0d9fd...,2024-06-23,Alabama
1,Senior Data Analyst,PCI Government Services,"Hybrid work in Huntsville, AL 35808","From $85,000 a year",Must have strong technical skills in areas suc...,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...,2024-06-23,Alabama
2,Data Scientist,"Interclypse, Inc.","Huntsville, AL",Full-time,Excellent interpersonal skills and ability to ...,https://www.indeed.com/rc/clk?jk=c34e8a98b5f9a...,2024-06-23,Alabama
3,"Data Scientist, Mid",Booz Allen,"Huntsville, AL","$75,600 - $172,000 a year","As a data scientist, you’re excited at the pro...",https://www.indeed.com/rc/clk?jk=908b996e5ba98...,2024-06-23,Alabama
4,Senior Data Analyst (U.S. remote eligible),"Eternal Word Television Network, Inc.",Remote in Alabama,NaN,You are experienced using web analytics and Go...,https://www.indeed.com/rc/clk?jk=400cd0aab0d76...,2024-06-23,Alabama
5,AIMSS - Data Scientist (All Levels),Intuitive Research and Technology Corporation,"Huntsville, AL 35805",Full-time,You will have opportunities to understand mach...,https://www.indeed.com/rc/clk?jk=bf7e7f21043de...,2024-06-23,Alabama
6,STATISTICIAN I,University of Alabama at Birmingham,"Birmingham, AL",Day shift,Collects and analyzes statistical data.\nColle...,https://www.indeed.com/rc/clk?jk=b78b78e795878...,2024-06-23,Alabama
7,Data Scientist (Top Secret),"Spry Methods, Inc","Huntsville, AL",Full-time,Stay updated with the latest advancements in d...,https://www.indeed.com/rc/clk?jk=4144324e302d6...,2024-06-23,Alabama
8,Senior Data Scientist,Hibbett | City Gear,"Birmingham, AL",Full-time,"Develop project plans, track progress, and com...",https://www.indeed.com/rc/clk?jk=66da143a6d04e...,2024-06-23,Alabama
9,"Data Scientist — ""Cancer Biology"" for Academic...",Tuskegee University,"Tuskegee, AL 36088",NaN,Apply advanced statistical techniques and mach...,https://www.indeed.com/rc/clk?jk=04bb0ca0f0d27...,2024-06-23,Alabama

- Format the datafame in order to scroll all columns and rows

In [5]:
pd.set_option('display.max_rows', None) 
pd.set_option('display.max_columns', None)

In [6]:
df.shape

(29184, 8)

In [7]:
df.info() # 5 columns have missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29184 entries, 0 to 29183
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Title        29184 non-null  object
 1   Company      29181 non-null  object
 2   Location     29182 non-null  object
 3   Salary       16283 non-null  object
 4   Description  22755 non-null  object
 5   Job URL      29181 non-null  object
 6   Date         29184 non-null  object
 7   State        29184 non-null  object
dtypes: object(8)
memory usage: 1.8+ MB

In [8]:
df.dtypes # Salary type should by float, date need to be converted to datetime data type.

Title          object
Company        object
Location       object
Salary         object
Description    object
Job URL        object
Date           object
State          object
dtype: object

In [9]:
df.describe()

,Title,Company,Location,Salary,Description,Job URL,Date,State
count,29184,29181,29182,16283,22755,29181,29184,29184
unique,8173,4085,3817,3527,12956,29181,36,52
top,Data Scientist,Amazon.com Services LLC,Remote,Full-time,"Note: Apple benefit, compensation and employee...",https://www.indeed.com/rc/clk?jk=b31b63cb0d9fd...,2024-06-23,California
freq,1407,948,1340,4560,139,1,4745,5400

__Data cleaning__

_Drop duplicate rows if any_

In [10]:
df.drop_duplicates().shape # no duplicate values found in the dataset.

(29184, 8)

In [11]:
df.replace(' ', np.nan, inplace=True) #Replace blank values to `NaN` if any

In [12]:
# Display missing values

df.isna().sum()

Title              0
Company            3
Location           2
Salary         12901
Description     6429
Job URL            3
Date               0
State              0
dtype: int64

__Data Cleaning__

Column: `Job URL`

In [13]:
df = df.drop(columns ='Job URL') # drop un-used column

Column: `Company`

In [14]:
def custom_capitalize(text):
    return ' '.join(word.capitalize() for word in text.split())

df['Company'] = df['Company'].astype(str)
df['Company'] = df['Company'].apply(custom_capitalize)

Column: `Title`

In [15]:
df['Title'] = df['Title'].apply(custom_capitalize)

Column: `Work Type`

In [24]:
df['Working Mode']=df['Title'].str.extract(r'(Remote|remote|Hybrid|hybrid)', expand=False)

In [31]:
df['Work_Type1'] = df['Location'][df['Location'] == 'Remote|remote|Hybrid|hybrid']
df['Working Mode'] = df['Work_Type1'].fillna(df['Working Mode'])

Column: `Level`

In [27]:
df['Level'] = df['Title'].str.extract(r'(?i)(Associate|Graduate|Senior|Junior|Entry-level|Manager|Lead)', expand=False)

In [28]:
df['Level']=df['Level'].fillna('Mid-level').str.capitalize() # if the postings are not indicated job level, fill with 'Mid level'.

Columns `City`, `Post Code`

In [29]:
df[['City','Post_Code']] = df['Location'].str.split(',', n=1, expand=True)

In [64]:
df['Post_Code']=df['Post_Code'].str.extract(r'(\d+)', expand=True) #extract the Post code from the string

In [ ]:
df['Work_Type'] = df['Work_Type1'].fillna(df['Work_Type'])

In [ ]:
df['Working Mode'].describe()

Column: `Salary`

In [49]:
# Function to extract digit from text
def extract_number(text):
    if pd.isna(text):
        return np.nan

    numbers = []
    for char in text:
        if char.isdigit() or char in ',.-':
            numbers.append(char)
    return ''.join(numbers).strip()

In [50]:
df['Salary']=df['Salary'].apply(extract_number)

In [51]:
df['Salary'] = df['Salary'].str.strip('-') #for the values is not the number, return to `Null` value 

df.replace('', np.nan, inplace=True)

In [52]:
df['Salary1'] = df['Description'].str.extract(r'(\$\d{1,3}(?:,\d{3})*(?:\.\d{2})?)') # extract salary that data is digit

In [53]:
df['Salary']= df['Salary'].fillna(df['Salary1'])

- Salary within a range, seperate into to column `Min salary` and `Max salary`

In [54]:
df[['Min_salary','Max_salary']]=df['Salary'].str.split('-', n=1, expand=True)

In [55]:
df['Max_salary']=df['Max_salary'].fillna(df['Min_salary']) #salary that is not a range, Min salary = Max salary

In [56]:
# Strip any blank space and replace the '-' & ',' from salary colum

df['Min_salary'] = df['Min_salary'].str.replace(r'[$,]', '', regex=True)
df['Max_salary'] = df['Max_salary'].str.replace(r'[$,]', '', regex=True)

In [57]:
# Convert to float

df['Min_salary'] = df['Min_salary'].astype(float)
df['Max_salary'] = df['Max_salary'].astype(float)

In [58]:
# Format the number with commas as thousands separators and no decimal places

pd.options.display.float_format = '{:,.0f}'.format

Column: `Average salary`

In [60]:
df['Average_salary'] = (df['Min_salary']+ df['Max_salary'])/2

In [61]:
df = df[df['Average_salary'] >= 30000] #suppose the annual salary is over or equal 30,000 dollars
df.head()

,Title,Company,Location,Salary,Description,Date,State,Working Mode,Level,City,Post_Code,Work_Type1,Salary1,Min_salary,Max_salary,Average_salary
1,Senior Data Analyst,Pci Government Services,"Hybrid work in Huntsville, AL 35808","85,000",Must have strong technical skills in areas suc...,2024-06-23,Alabama,NaN,Senior,Hybrid work in Huntsville,AL 35808,NaN,NaN,"85,000","85,000","85,000"
3,"Data Scientist, Mid",Booz Allen,"Huntsville, AL","75,600-172,000","As a data scientist, you’re excited at the pro...",2024-06-23,Alabama,NaN,Mid-level,Huntsville,AL,NaN,NaN,"75,600","172,000","123,800"
15,"Data Scientist, Senior",Booz Allen,"Huntsville, AL","96,600-220,000",Your deep data science and complimentary techn...,2024-06-23,Alabama,NaN,Senior,Huntsville,AL,NaN,NaN,"96,600","220,000","158,300"
29,Ai/ml Software Engineer,Leidos,"Huntsville, AL 35806","81,250-146,875",You will also be responsible for working with ...,2024-06-23,Alabama,NaN,Mid-level,Huntsville,AL 35806,NaN,NaN,"81,250","146,875","114,062"
30,"Product Lead, Ai",Recruiting From Scratch,"Huntsville, AL","140,000-180,000",Facilitate rapid experimentation and data-driv...,2024-06-23,Alabama,NaN,Lead,Huntsville,AL,NaN,NaN,"140,000","180,000","160,000"

Column: `State`

- If the `State` column stated the value 'Remote' as the state, then the city and working type is also Remote

In [62]:
df['City1'] = df['State'][df['State'] == 'Remote']

- Update column city if state is `Remote`

In [63]:
df['City'] = df['City1'].fillna(df['City'])

Column: `City`

- If `City` is remote then work type is remote

In [64]:
df['Work_Type1'] =df['City'][df['City'] == 'Remote']

- Fill the Remote values to main `Working Mode` column

In [66]:
df['Working Mode'] = df['Work_Type1'].fillna(df['Working Mode'])

- Extract the `City` after the word 'in'

In [67]:
df['City'] = df['City'].apply(lambda x: x.split(' in ', 1)[-1].strip() if 'in' in x else x)

- If `Work_Type` is null, then suppose the type is 'on-site'

In [68]:
df['Working Mode'] = df['Working Mode'].fillna('On-Site')

Column: `Date`

- Convert the data type to `Datetime`

In [69]:
df['Date'] = pd.to_datetime(df['Date'])

- Update and re-order the columns in the dataset, remove unused columns

In [72]:
df = df[['Date','Company', 'State', 'City', 'Level', 'Working Mode', 'Average_salary']]

In [73]:
df.isna().sum()

Date              0
Company           0
State             0
City              0
Level             0
Working Mode      0
Average_salary    0
dtype: int64

In [74]:
df.shape

(9391, 7)

In [75]:
df.head(10)

,Date,Company,State,City,Level,Working Mode,Average_salary
1,2024-06-23,Pci Government Services,Alabama,Huntsville,Senior,On-Site,"85,000"
3,2024-06-23,Booz Allen,Alabama,Huntsville,Mid-level,On-Site,"123,800"
15,2024-06-23,Booz Allen,Alabama,Huntsville,Senior,On-Site,"158,300"
29,2024-06-23,Leidos,Alabama,Huntsville,Mid-level,On-Site,"114,062"
30,2024-06-23,Recruiting From Scratch,Alabama,Huntsville,Lead,On-Site,"160,000"
33,2024-06-23,Recruiting From Scratch,Alabama,Huntsville,Senior,On-Site,"165,000"
41,2024-06-23,Prosper,Arizona,Phoenix,Mid-level,On-Site,"162,500"
42,2024-06-23,Us Dhs Headquarters,Arizona,Chandler,Lead,On-Site,"162,050"
45,2024-06-23,Clarivate,Arizona,Chandler,Senior,On-Site,"136,000"
48,2024-06-23,City National Bank,Arizona,Phoenix,Mid-level,On-Site,"165,625"

_Download the dataset to CSV file without the index_

In [76]:
df.to_csv('completed_file.csv', index = False)